asyncio.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>asyncio in Python</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://orgmode.org/worg/style/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">asyncio in Python</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org19c35dd">thread vs asyncio</a></li>
<li><a href="#org6318cd3">async def f</a></li>
<li><a href="#org8ef9150">asyncio.create<sub>task</sub>(coroutine)</a></li>
<li><a href="#orgb5d55e8">await</a></li>
</ul>
</div>
</div>
<p>
It is an event loop with callback functions in it.
</p>

<p>
An event loop is single-threaded. Therefore, stuff that goes inside the event loop should not be CPU heavy (Usually IO or HTTP request). If you have a CPU-heavy task. You can have an executor that runs this task in a separate thread/process and wait for the result in the event loop.
</p>

<div id="outline-container-org19c35dd" class="outline-2">
<h2 id="org19c35dd">thread vs asyncio</h2>
<div class="outline-text-2" id="text-org19c35dd">
<ul class="org-ul">
<li>thread use lock to tell where it is <b>impossible</b> to go to another task.</li>
<li>asyncio use await to tell where is ti <b>possible</b> to go to another task.</li>
</ul>
</div>
</div>

<div id="outline-container-org6318cd3" class="outline-2">
<h2 id="org6318cd3">async def f</h2>
<div class="outline-text-2" id="text-org6318cd3">
<p>
it defines a coroutine. If you call <code>f()</code> directly, the return is a coroutine object.
</p>
</div>
</div>

<div id="outline-container-org8ef9150" class="outline-2">
<h2 id="org8ef9150">asyncio.create<sub>task</sub>(coroutine)</h2>
<div class="outline-text-2" id="text-org8ef9150">
<ul class="org-ul">
<li>Wrap a coroutine into a task.</li>
<li>It creates a copy of the context for later execution.</li>
<li>Put the task into the event loop. It will not start executing until the interpreter reaches an <code>await</code> statement.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb5d55e8" class="outline-2">
<h2 id="orgb5d55e8">await</h2>
<div class="outline-text-2" id="text-orgb5d55e8">
<ol class="org-ol">
<li>Block: register the stuff afterward as a callback in the event loop. It will be executed after await's result/timer comes back.</li>
<li>waiting part:
<ul class="org-ul">
<li><code>await coroutine1</code>: run coroutine1 immediately in the current context.</li>
<li><code>await task1</code>: go back to the event loop and execute the next function. if task1 is not on top of the event loop, it may not be the next to execute.</li>
</ul></li>
</ol>

<script src="https://utteranc.es/client.js"
        repo="sychen52/sychen52.github.io"
        issue-term="pathname"
        theme="github-light"
        crossorigin="anonymous"
        async>
</script>
</div>
</div>
</div>
</body>
</html>
